// Updated at 2025-06-12

import { Route, Stop } from "../utils/model.ts";

const routes: Array<Route> = [
  // 国際教養大学前⇒ｲｵﾝﾓｰﾙ秋田
  {
    id: "1",
    displayId: "AIU",
    source: { en: "バス" },
    dest: "5",
    orig: "1",
    stops: ["1", "2", "3", "4", "5"],
  },
  // ｲｵﾝﾓｰﾙ秋田⇒国際教養大学前
  {
    id: "1+",
    displayId: "AIU",
    source: { en: "バス" },
    dest: "1",
    orig: "5",
    stops: ["5", "4", "3", "2", "1"],
  },
  // 国際教養大学前⇒和田駅
  {
    id: "2",
    displayId: "AIU",
    source: { en: "バス" },
    dest: "6",
    orig: "1",
    stops: ["1", "6"],
  },
  // 和田駅⇒国際教養大学前
  {
    id: "2+",
    displayId: "AIU",
    source: { en: "バス" },
    dest: "1",
    orig: "6",
    stops: ["6", "1"],
  },
  // 国際教養大学前⇒秋田空港
  {
    id: "3",
    displayId: "AIU",
    source: { en: "バス" },
    dest: "7",
    orig: "1",
    stops: ["1", "7"],
  },
  // 秋田空港⇒国際教養大学前
  {
    id: "3+",
    displayId: "AIU",
    source: { en: "バス" },
    dest: "1",
    orig: "7",
    stops: ["7", "1"],
  },
];

const stops: Array<Stop> = [
  { id: "1", name: { en: "国際教養大学前" }, lat: 39.626371, long: 140.197748 },
  {
    id: "2",
    name: { en: "スポーツゾーン入口" },
    lat: 39.625462,
    long: 140.195917,
  },
  { id: "3", name: { en: "御所野" }, lat: 39.660623, long: 140.168889 },
  {
    id: "4",
    name: { en: "御所野ニュータウン" },
    lat: 39.662723,
    long: 140.164687,
  },
  {
    id: "5",
    name: { en: "イオンモール秋田" },
    lat: 39.662521,
    long: 140.160781,
  },
  {
    id: "6",
    name: { en: "和田駅" },
    lat: 39.651035,
    long: 140.217908,
  },
  {
    id: "7",
    name: { en: "秋田空港" },
    lat: 39.611576,
    long: 140.220176,
  },
];

const timetables: {
  [id: string]: {
    timeTake: number[];
    regular: number[][];
    holiday?: number[][];
    semBreak?: number[][];
  };
} = {
  "1": {
    timeTake: [0, 8, 1, 6],
    regular: [
      [9, 15],
      [12, 10],
      [15, 25],
      [18, 10],
      [19, 30],
      [21, 45],
    ],
    holiday: [
      [9, 15],
      [10, 30],
      [12, 10],
      [14, 30],
      [15, 25],
      [16, 30],
      [18, 10],
      [18, 40],
      [19, 30],
      [21, 45],
    ],
    semBreak: [
      [9, 15],
      [10, 30],
      [12, 10],
      [15, 25],
      [18, 40],
    ],
  },
  "1+": {
    timeTake: [6, 1, 8, 0],
    regular: [
      [8, 0],
      [9, 15],
      [11, 30],
      [15, 5],
      [16, 55],
      [19, 10],
      [21, 10],
      [22, 10],
    ],
    holiday: [
      [8, 0],
      [9, 15],
      [10, 5],
      [11, 30],
      [13, 15],
      [15, 5],
      [16, 0],
      [16, 55],
      [18, 5],
      [19, 10],
      [21, 10],
      [22, 10],
    ],
    semBreak: [
      [8, 0],
      [10, 5],
      [11, 30],
      [15, 5],
      [16, 55],
      [21, 10],
      [22, 10],
    ],
  },
  "2": {
    timeTake: [15],
    regular: [[17, 35]],
  },
  "2+": {
    timeTake: [15],
    regular: [[8, 35]],
  },
  "3": {
    timeTake: [15],
    regular: [
      [8, 25],
      [15, 20],
    ],
  },
  "3+": {
    timeTake: [8],
    regular: [
      [8, 35],
      [15, 30],
    ],
  },
};

const holidays = ["2026-03-21", "2026-04-30", "2026-05-01", "2026-10-14"];

const semBreaks = [
  ["2025-08-01", "2025-08-31"],
  ["2025-12-25", "2026-01-04"],
  ["2026-03-05", "2026-03-20"],
  ["2026-03-22", "2026-03-31"],
];

const specialRoutes: { [id: string]: { onlyOn: Array<string> } } = {
  "3": {
    onlyOn: [
      "2025-04-01",
      "2025-04-08",
      "2025-08-25",
      "2025-09-01",
      "2025-10-12",
      "2025-10-13",
      "2025-12-19",
      "2025-12-20",
      "2025-12-21",
      "2025-12-22",
      "2025-12-23",
      "2025-12-24",
      "2026-03-21",
    ],
  },
  "3+": {
    onlyOn: [
      "2025-04-01",
      "2025-04-08",
      "2025-08-25",
      "2025-09-01",
      "2025-10-12",
      "2025-10-13",
      "2025-12-19",
      "2025-12-20",
      "2025-12-21",
      "2025-12-22",
      "2025-12-23",
      "2025-12-24",
      "2026-03-21",
    ],
  },
};

export { routes, stops, timetables, holidays, semBreaks, specialRoutes };
